app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "publish_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "teste"], ["body", "teste"], ["publish_at", "2015-06-30 21:45:00.000000"], ["created_at", "2015-03-30 21:45:55.803567"], ["updated_at", "2015-03-30 21:45:55.803567"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "category_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["category_id", 1], ["updated_at", "2015-04-17 18:36:27.573461"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)